docs/evidence/run-1-guessed-requests/08-k6-summary.txt
default   [  98% ] 04/40 VUs  5m25.0s/5m30.0s

running (5m26.0s), 03/40 VUs, 84695 complete and 0 interrupted iterations
default   [  99% ] 03/40 VUs  5m26.0s/5m30.0s

running (5m27.0s), 03/40 VUs, 84723 complete and 0 interrupted iterations
default   [  99% ] 03/40 VUs  5m27.0s/5m30.0s

running (5m28.0s), 02/40 VUs, 84742 complete and 0 interrupted iterations
default   [  99% ] 02/40 VUs  5m28.0s/5m30.0s

running (5m29.0s), 01/40 VUs, 84757 complete and 0 interrupted iterations
default   [ 100% ] 01/40 VUs  5m29.0s/5m30.0s

running (5m30.0s), 01/40 VUs, 84767 complete and 0 interrupted iterations
default   [ 100% ] 01/40 VUs  5m30.0s/5m30.0s

     ✓ status is 200

     checks.........................: 100.00% 84768 out of 84768
     data_received..................: 1.4 GB  4.4 MB/s
     data_sent......................: 9.2 MB  28 kB/s
     http_req_blocked...............: avg=7.47µs   min=1.52µs   med=4.86µs   max=16.24ms  p(90)=6.86µs   p(95)=8.18µs  
     http_req_connecting............: avg=318ns    min=0s       med=0s       max=16.18ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=15.13ms  min=4.4ms    med=11.25ms  max=379.48ms p(90)=27.01ms  p(95)=36.44ms 
       { expected_response:true }...: avg=15.13ms  min=4.4ms    med=11.25ms  max=379.48ms p(90)=27.01ms  p(95)=36.44ms 
   ✓ http_req_failed................: 0.00%   0 out of 84768
     http_req_receiving.............: avg=414.01µs min=15.92µs  med=105.56µs max=88.54ms  p(90)=763.07µs p(95)=1.49ms  
     http_req_sending...............: avg=19.41µs  min=4.03µs   med=12.53µs  max=8.1ms    p(90)=22.28µs  p(95)=32.93µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=14.7ms   min=4.33ms   med=10.9ms   max=378.94ms p(90)=26.25ms  p(95)=35.48ms 
     http_reqs......................: 84768   256.817588/s
     iteration_duration.............: avg=115.9ms  min=104.77ms med=111.99ms max=480.31ms p(90)=127.91ms p(95)=137.47ms
     iterations.....................: 84768   256.817588/s
     vus............................: 1       min=1              max=40
     vus_max........................: 40      min=40             max=40


running (5m30.1s), 00/40 VUs, 84768 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/40 VUs  5m30s